#+Title: NES TODO LIST
#+subtitle: And quick notes for faster daily reuptake.

* v0.1 : "CPU"
** DONE [100%] v0.0.0
*** DONE Basic File Structure
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
*** DONE Basic CPU Struct/IMPL
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
**** DONE test_new()
*** DONE Addressing Modes
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
**** DONE test_AM()
** DONE [100%] v0.1.0
*** DONE Flags
**** DONE test_status_each()
**** DONE test_status_settingtwice()
*** DONE Basic Memory/Registers
**** DONE test_new_memory()
*** DONE CLC, CLD, CLI, CLV, SEC, SED, SEI.
**** DONE testOP_flags()
*** DONE LDA
**** DONE testOP_LDA()
*** DONE LDX
**** DONE testOP_LDX()
*** DONE LDY
CLOSED: [2018-11-18 Sun 12:38]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:38]
**** DONE testOP_LDY()
** DONE [100%] v0.1.1 : "Primary Arithmetic Operations"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
:LOGBOOK:
CLOCK: [2018-11-19 Mon 12:10]--[2018-11-19 Mon 13:05] =>  0:55
:END:
*** DONE ADC : "Add with Carry"
CLOSED: [2018-11-19 Mon 09:59]
- State "DONE"       from "TODO"       [2018-11-19 Mon 09:59]
**** DONE testOP_ADC()
CLOSED: [2018-11-18 Sun 10:42]
- State "DONE"       from "TODO"       [2018-11-18 Sun 10:42]
**** DONE testOP_ADC_signed()
CLOSED: [2018-11-18 Sun 12:12]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:12]
:LOGBOOK:
CLOCK: [2018-11-18 Sun 10:51]--[2018-11-18 Sun 12:06] =>  1:15
:END:
**** WAIT testOP_ADC_decimal()
CLOSED: [2018-11-19 Mon 09:58]
- State "WAIT"       from              [2018-11-19 Mon 09:58] \\
  See documentation on issue #1, or src/core/cpu_test.rs::testOP_ADC_decimal().
*** DONE SBC : "Subtract with Borrow"
CLOSED: [2018-11-19 Mon 11:39]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:39]
**** DONE testOP_SBC()
CLOSED: [2018-11-19 Mon 11:38]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:38]
**** DONE testOP_SBC_signed()
CLOSED: [2018-11-19 Mon 11:38]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:38]
**** WAIT testOP_SBC_decimal()
CLOSED: [2018-11-19 Mon 11:38]
- State "WAIT"       from              [2018-11-19 Mon 11:38] \\
  Same as [[testOP_ADC_decimal()]]...
*** DONE AND : "Bitwise AND with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_AND()
CLOSED: [2018-11-19 Mon 12:03]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:03]
*** DONE EOR : "Bitwise Exclusive OR with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_EOR()
CLOSED: [2018-11-19 Mon 12:10]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:10]
:LOGBOOK:
CLOCK: [2018-11-19 Mon 12:03]--[2018-11-19 Mon 12:10] =>  0:07
:END:
*** DONE ORA : "Bitwise OR with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_ORA()
CLOSED: [2018-11-19 Mon 12:10]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:10]
** DONE [100%] v0.1.2 : "Bit Manipulation"
CLOSED: [2018-11-21 Wed 10:46]
- State "DONE"       from "TODO"       [2018-11-21 Wed 10:46]
:LOGBOOK:
CLOCK: [2018-11-21 Wed 09:24]--[2018-11-21 Wed 10:46] =>  1:22
:END:
*** DONE ASL : "Arithmatic Shift Left"
CLOSED: [2018-11-21 Wed 09:24]
- State "DONE"       from "TODO"       [2018-11-21 Wed 09:24]
Refer to 10.5 in KIM guide.
**** DONE testOP_ASL
CLOSED: [2018-11-21 Wed 09:24]
- State "DONE"       from "TODO"       [2018-11-21 Wed 09:24]
*** DONE LSR : "Logical Shift Right"
CLOSED: [2018-11-21 Wed 09:30]
- State "DONE"       from "TODO"       [2018-11-21 Wed 09:30]
**** DONE testOP_LSR
CLOSED: [2018-11-21 Wed 09:29]
- State "DONE"       from "TODO"       [2018-11-21 Wed 09:29]
*** DONE ROL : "Rotate Left"
CLOSED: [2018-11-21 Wed 10:31]
- State "DONE"       from "TODO"       [2018-11-21 Wed 10:31]
**** DONE testOP_ROL
CLOSED: [2018-11-21 Wed 10:31]
- State "DONE"       from "TODO"       [2018-11-21 Wed 10:31]
*** DONE ROR : "Rotate Right"
CLOSED: [2018-11-21 Wed 10:46]
- State "DONE"       from "TODO"       [2018-11-21 Wed 10:46]
**** DONE testOP_ROR
CLOSED: [2018-11-21 Wed 10:31]
- State "DONE"       from "TODO"       [2018-11-21 Wed 10:31]
** TODO [40%] v0.1.3 : "Register/Memory Manipulation"
*** DONE DEC : "Increment Memory By One"
CLOSED: [2018-12-17 Mon 17:46]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:46]
**** DONE testOP_DEC
CLOSED: [2018-12-17 Mon 17:14]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:14]
*** DONE DEX : "Decrement Index Register X by One"
CLOSED: [2018-12-17 Mon 17:46]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:46]
**** DONE testOP_DEX
CLOSED: [2018-12-17 Mon 17:14]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:14]
*** DONE DEY : "Decrement Index Register Y by One"
CLOSED: [2018-12-17 Mon 17:46]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:46]
**** DONE testOP_DEY
CLOSED: [2018-12-17 Mon 17:14]
- State "DONE"       from "TODO"       [2018-12-17 Mon 17:14]
*** DONE INC : "Increment Memory By One"
CLOSED: [2019-01-03 Thu 23:19]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:19]
**** DONE testOP_INC
CLOSED: [2019-01-03 Thu 23:18]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:18]
*** DONE INX : "Increment Index Register X by One"
CLOSED: [2019-01-03 Thu 23:19]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:19]
**** DONE testOP_INX
CLOSED: [2019-01-03 Thu 23:18]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:18]
*** DONE INY : "Increment Index Register Y by One"
CLOSED: [2019-01-03 Thu 23:19]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:19]
**** DONE testOP_INY
CLOSED: [2019-01-03 Thu 23:19]
- State "DONE"       from "TODO"       [2019-01-03 Thu 23:19]
*** TODO STA : "Store Accumulator in Memory"
**** TODO testOP_STA
*** TODO STX : "Store Index Register X in Memory"
**** TODO testOP_STX
*** TODO STY : "Store Index Register Y in Memory"
**** TODO testOP_STY
*** TODO TAX : "Transfer Accumulator to Index X"
**** TODO testOP_TAX
*** TODO TAY : "Transfer Accumulator to Index Y"
**** TODO testOP_TAY
*** TODO TSX : "Transfer Stack Pointer to Index"
**** TODO testOP_TSX
*** TODO TXA : "Transfer Index X to Accumulator"
**** TODO testOP_TXA
*** TODO TXS : "Transfer Index X to Stack Pointer"
**** TODO testOP_TXS
*** TODO TYA : "Transfer Index Y to Accumulator"
**** TODO testOP_TYA
** TODO [0%] v0.1.4 : "General Operations"
*** TODO BIT : "Test Bits in Memory with Accumulator"
**** TODO testOP_BIT
*** TODO BRK : "Break"
**** TODO testOP_BRK
*** TODO NOP : "No Operation"
**** TODO testOP_NOP
*** TODO RTI : "Return From Interrupt"
**** TODO testOP_RTI
** TODO [0%] v0.1.5 : "Stack Manipulation"
*** TODO RTS : "Return from Subroutine"
** TODO [0%] v0.1.6 : "Comparators"
** TODO [0%] v0.1.7 : "Branching/Jumping"
* v0.2 : "Memory"
* v0.3 : "PPU"
* Notes
//[1]	0: carry flag
//	1: zero flag
//  	2: interrupt disable flag
//  	3: decimal mode flag
//  	4: break command flag
//  	5: unused flag
//  	6: overflow flag
//  	7: negative flag
//
//[3] 	izx = indexed indirect =  12
//    	izy = indirect indexed = 11
//    	ind = indirect = 10
//    	zp = zero page = 3
//    	zpx = zero page x = 4
//    	zpy = zero page y = 5
//    	abs = absolute val = 6
//    	abx = absolute val x = 7 
//    	aby = absolute val y = 8
//    	imm = immediate = 2
//    	rel = relative = 9
